package net.skykingdoms.api.backend.permission;

/**
 * Тип прав которые имеет группа. Группа, которая не имеет
 * типа прав сравниваемой не будет иметь её права, даже если
 * она выше
 *
 * Все типы прав отсортированы по приоритетности! По приоритету
 * будет взята отображаемая группа игрока на сервере
 */
public enum PermissionType {

    /**
     * Прочие группы, типо переводчиков или еще кого-то, у них нет приоритета
     * по отношению к донату итд, они просто идут как дополнительные и дают доп. права
     */
    OTHER,

    /**
     * Дефолтная иерархия прав, тут донат-группы и группа игрока
     */
    DEFAULT,

    /**
     * Подписка. Этот тип прав будет у группы Elite, для неё необходимо
     * наличие уже определенной привилегии и она дает только дополнительные
     * права, не затрагивая права основной группы
     */
    SUBSCRIPTION,

    /**
     * Специальная привилегия по типу Nitro, то есть для тех кто как бы
     * должен донатить чтобы получить основные фичи, но все еще имеет их
     * больше чем другие игроки
     */
    SPECIAL,

    /**
     * Персонал проекта, у него есть особые права, но все равно
     * нет прав донат-групп ниже
     */
    STAFF,

    /**
     * Выданные ютуберы и прочие медийные личности, у них так же свой тип прав
     */
    MEDIA;

    public static final PermissionType[] VALUES = values();
}
